<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","label":"management","backend":"01f70e6434b0c3f32a0b9d987fc3949435962f5caf1b6b7ee43a981d28e85f1e","plan_job_ref":"Job PR-PLAN #14 at https://github.com/Workquark/Terraform/actions/runs/14129804367","plan_out_hash":"452de1e4bc914975c3ced54e4172c61dc51f1077242bbad216234349105082bc","plan_hash":"59fbfdc25444ee3a445d462ab74006fc3eee1016dea9560bacec0f497e5bbd37","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __management__
<details>
<summary>Plan: 27 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_client_config.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "default" {
+       access_token   = (sensitive value)
+       default_labels = (known after apply)
+       id             = (known after apply)
+       project        = (known after apply)
+       region         = (known after apply)
+       zone           = (known after apply)
    }

  # module.gke_dev.data.google_client_config.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "default" {
+       access_token   = (sensitive value)
+       default_labels = (known after apply)
+       id             = (known after apply)
+       project        = (known after apply)
+       region         = (known after apply)
+       zone           = (known after apply)
    }

  # module.twingate.google_compute_instance.twingate[0] will be created
+   resource "google_compute_instance" "twingate" {
+       allow_stopping_for_update = true
+       can_ip_forward            = false
+       cpu_platform              = (known after apply)
+       creation_timestamp        = (known after apply)
+       current_status            = (known after apply)
+       deletion_protection       = false
+       effective_labels          = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       id                        = (known after apply)
+       instance_id               = (known after apply)
+       label_fingerprint         = (known after apply)
+       machine_type              = "e2-micro"
+       metadata                  = (known after apply)
+       metadata_fingerprint      = (known after apply)
+       metadata_startup_script   = <<-EOT
            echo 'net.ipv4.ping_group_range = 0 2147483647' | sudo tee -a /etc/sysctl.d/99-allow-ping.conf
                sudo sysctl -p /etc/sysctl.d/99-allow-ping.conf
        EOT
+       min_cpu_platform          = (known after apply)
+       name                      = "jrc-online-management-twingate-0"
+       project                   = "concise-mesh-453415-t8"
+       self_link                 = (known after apply)
+       tags_fingerprint          = (known after apply)
+       terraform_labels          = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       zone                      = "europe-west1-b"

+       boot_disk {
+           auto_delete                = true
+           device_name                = (known after apply)
+           disk_encryption_key_sha256 = (known after apply)
+           kms_key_self_link          = (known after apply)
+           mode                       = "READ_WRITE"
+           source                     = (known after apply)

+           initialize_params {
+               image                  = (known after apply)
+               labels                 = (known after apply)
+               provisioned_iops       = (known after apply)
+               provisioned_throughput = (known after apply)
+               resource_policies      = (known after apply)
+               size                   = (known after apply)
+               type                   = (known after apply)
            }
        }

+       confidential_instance_config (known after apply)

+       guest_accelerator (known after apply)

+       network_interface {
+           internal_ipv6_prefix_length = (known after apply)
+           ipv6_access_type            = (known after apply)
+           ipv6_address                = (known after apply)
+           name                        = (known after apply)
+           network                     = (known after apply)
+           network_ip                  = (known after apply)
+           stack_type                  = (known after apply)
+           subnetwork                  = "ops-management-subnet-1"
+           subnetwork_project          = "concise-mesh-453415-t8"
        }

+       reservation_affinity (known after apply)

+       scheduling (known after apply)

+       shielded_instance_config {
+           enable_integrity_monitoring = true
+           enable_secure_boot          = true
+           enable_vtpm                 = true
        }
    }

  # module.twingate.google_compute_instance.twingate[1] will be created
+   resource "google_compute_instance" "twingate" {
+       allow_stopping_for_update = true
+       can_ip_forward            = false
+       cpu_platform              = (known after apply)
+       creation_timestamp        = (known after apply)
+       current_status            = (known after apply)
+       deletion_protection       = false
+       effective_labels          = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       id                        = (known after apply)
+       instance_id               = (known after apply)
+       label_fingerprint         = (known after apply)
+       machine_type              = "e2-micro"
+       metadata                  = (known after apply)
+       metadata_fingerprint      = (known after apply)
+       metadata_startup_script   = <<-EOT
            echo 'net.ipv4.ping_group_range = 0 2147483647' | sudo tee -a /etc/sysctl.d/99-allow-ping.conf
                sudo sysctl -p /etc/sysctl.d/99-allow-ping.conf
        EOT
+       min_cpu_platform          = (known after apply)
+       name                      = "jrc-online-management-twingate-1"
+       project                   = "concise-mesh-453415-t8"
+       self_link                 = (known after apply)
+       tags_fingerprint          = (known after apply)
+       terraform_labels          = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       zone                      = "europe-west1-b"

+       boot_disk {
+           auto_delete                = true
+           device_name                = (known after apply)
+           disk_encryption_key_sha256 = (known after apply)
+           kms_key_self_link          = (known after apply)
+           mode                       = "READ_WRITE"
+           source                     = (known after apply)

+           initialize_params {
+               image                  = (known after apply)
+               labels                 = (known after apply)
+               provisioned_iops       = (known after apply)
+               provisioned_throughput = (known after apply)
+               resource_policies      = (known after apply)
+               size                   = (known after apply)
+               type                   = (known after apply)
            }
        }

+       confidential_instance_config (known after apply)

+       guest_accelerator (known after apply)

+       network_interface {
+           internal_ipv6_prefix_length = (known after apply)
+           ipv6_access_type            = (known after apply)
+           ipv6_address                = (known after apply)
+           name                        = (known after apply)
+           network                     = (known after apply)
+           network_ip                  = (known after apply)
+           stack_type                  = (known after apply)
+           subnetwork                  = "ops-management-subnet-1"
+           subnetwork_project          = "concise-mesh-453415-t8"
        }

+       reservation_affinity (known after apply)

+       scheduling (known after apply)

+       shielded_instance_config {
+           enable_integrity_monitoring = true
+           enable_secure_boot          = true
+           enable_vtpm                 = true
        }
    }

  # module.twingate.null_resource.version will be created
+   resource "null_resource" "version" {
+       id       = (known after apply)
+       triggers = {
+           "version" = "1.73.0"
        }
    }

  # module.twingate.twingate_connector.connector[0] will be created
+   resource "twingate_connector" "connector" {
+       id                     = (known after apply)
+       name                   = "twingate-management-0"
+       remote_network_id      = (known after apply)
+       status_updates_enabled = (known after apply)
    }

  # module.twingate.twingate_connector.connector[1] will be created
+   resource "twingate_connector" "connector" {
+       id                     = (known after apply)
+       name                   = "twingate-management-1"
+       remote_network_id      = (known after apply)
+       status_updates_enabled = (known after apply)
    }

  # module.twingate.twingate_connector_tokens.tokens[0] will be created
+   resource "twingate_connector_tokens" "tokens" {
+       access_token  = (sensitive value)
+       connector_id  = (known after apply)
+       id            = (known after apply)
+       refresh_token = (sensitive value)
    }

  # module.twingate.twingate_connector_tokens.tokens[1] will be created
+   resource "twingate_connector_tokens" "tokens" {
+       access_token  = (sensitive value)
+       connector_id  = (known after apply)
+       id            = (known after apply)
+       refresh_token = (sensitive value)
    }

  # module.twingate.twingate_remote_network.network will be created
+   resource "twingate_remote_network" "network" {
+       id       = (known after apply)
+       location = "GOOGLE_CLOUD"
+       name     = "jrc-online-management-vpc-network"
    }

  # module.twingate.twingate_resource.twingate_resources will be created
+   resource "twingate_resource" "twingate_resources" {
+       address                     = "10.80.21.0/28"
+       id                          = (known after apply)
+       is_active                   = true
+       is_authoritative            = (known after apply)
+       is_browser_shortcut_enabled = false
+       is_visible                  = true
+       name                        = "jrc-online-management-gke"
+       protocols                   = {
+           allow_icmp = true
+           tcp        = {
+               policy = "ALLOW_ALL"
+               ports  = []
            }
+           udp        = {
+               policy = "ALLOW_ALL"
+               ports  = []
            }
        }
+       remote_network_id           = (known after apply)

+       access_group {
+           group_id = "****************"
        }
    }

  # module.base.module.dns_zones_iam_binding.google_dns_managed_zone_iam_member.dns_zone_iam_additive["default--roles/dns.admin--serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"] will be created
+   resource "google_dns_managed_zone_iam_member" "dns_zone_iam_additive" {
+       etag         = (known after apply)
+       id           = (known after apply)
+       managed_zone = "druidsoft-in"
+       member       = "serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project      = "concise-mesh-453415-t8"
+       role         = "roles/dns.admin"
    }

  # module.base.module.dns_zones_iam_binding.google_dns_managed_zone_iam_member.dns_zone_iam_additive["default--roles/dns.admin--serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"] will be created
+   resource "google_dns_managed_zone_iam_member" "dns_zone_iam_additive" {
+       etag         = (known after apply)
+       id           = (known after apply)
+       managed_zone = "druidsoft-in"
+       member       = "serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project      = "concise-mesh-453415-t8"
+       role         = "roles/dns.admin"
    }

  # module.gke_dev.module.gke.data.google_compute_zones.available[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "concise-mesh-453415-t8"
+       region  = "europe-west1"
    }

  # module.gke_dev.module.gke.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "europe-west1"
+       project                         = "concise-mesh-453415-t8"
+       release_channel_default_version = (known after apply)
+       release_channel_latest_version  = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke_dev.module.gke.data.google_container_engine_versions.zone will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = (known after apply)
+       project                         = "concise-mesh-453415-t8"
+       release_channel_default_version = (known after apply)
+       release_channel_latest_version  = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke_dev.module.gke.google_container_cluster.primary will be created
+   resource "google_container_cluster" "primary" {
+       cluster_ipv4_cidr                        = (known after apply)
+       datapath_provider                        = (known after apply)
+       default_max_pods_per_node                = 110
+       deletion_protection                      = false
+       effective_labels                         = {
+           "goog-terraform-provisioned" = "true"
        }
+       enable_cilium_clusterwide_network_policy = false
+       enable_fqdn_network_policy               = false
+       enable_intranode_visibility              = true
+       enable_kubernetes_alpha                  = false
+       enable_l4_ilb_subsetting                 = true
+       enable_legacy_abac                       = false
+       enable_multi_networking                  = false
+       enable_shielded_nodes                    = true
+       enable_tpu                               = false
+       endpoint                                 = (known after apply)
+       id                                       = (known after apply)
+       label_fingerprint                        = (known after apply)
+       location                                 = "europe-west1"
+       logging_service                          = "logging.googleapis.com/kubernetes"
+       master_version                           = (known after apply)
+       min_master_version                       = "1.32.2"
+       monitoring_service                       = "monitoring.googleapis.com/kubernetes"
+       name                                     = "jrc-online-management-gke-cluster"
+       network                                  = "projects/concise-mesh-453415-t8/global/networks/jrc-online-management-vpc-network"
+       networking_mode                          = "VPC_NATIVE"
+       node_locations                           = (known after apply)
+       node_version                             = (known after apply)
+       operation                                = (known after apply)
+       private_ipv6_google_access               = (known after apply)
+       project                                  = "concise-mesh-453415-t8"
+       remove_default_node_pool                 = true
+       self_link                                = (known after apply)
+       services_ipv4_cidr                       = (known after apply)
+       subnetwork                               = "projects/concise-mesh-453415-t8/regions/europe-west1/subnetworks/gke-management-cluster-subnet-1"
+       terraform_labels                         = {
+           "goog-terraform-provisioned" = "true"
        }
+       tpu_ipv4_cidr_block                      = (known after apply)
#        (1 unchanged attribute hidden)

+       addons_config {
+           cloudrun_config (known after apply)
+           config_connector_config {
+               enabled = false
            }
+           dns_cache_config {
+               enabled = false
            }
+           gce_persistent_disk_csi_driver_config {
+               enabled = true
            }
+           gcp_filestore_csi_driver_config {
+               enabled = true
            }
+           gcs_fuse_csi_driver_config (known after apply)
+           gke_backup_agent_config {
+               enabled = true
            }
+           horizontal_pod_autoscaling {
+               disabled = false
            }
+           http_load_balancing {
+               disabled = false
            }
+           istio_config {
+               auth     = "AUTH_MUTUAL_TLS"
+               disabled = true
            }
+           kalm_config {
+               enabled = false
            }
+           network_policy_config {
+               disabled = false
            }
+           parallelstore_csi_driver_config (known after apply)
+           ray_operator_config (known after apply)
+           stateful_ha_config (known after apply)
        }

+       authenticator_groups_config (known after apply)

+       cluster_autoscaling {
+           auto_provisioning_locations = (known after apply)
+           autoscaling_profile         = "BALANCED"
+           enabled                     = false

+           auto_provisioning_defaults (known after apply)
        }

+       cluster_telemetry (known after apply)

+       confidential_nodes (known after apply)

+       control_plane_endpoints_config {
+           dns_endpoint_config {
+               allow_external_traffic = false
+               endpoint               = (known after apply)
            }
        }

+       cost_management_config {
+           enabled = true
        }

+       database_encryption {
+           state    = "DECRYPTED"
#            (1 unchanged attribute hidden)
        }

+       default_snat_status {
+           disabled = false
        }

+       gateway_api_config {
+           channel = "CHANNEL_STANDARD"
        }

+       identity_service_config {
+           enabled = false
        }

+       ip_allocation_policy {
+           cluster_ipv4_cidr_block       = (known after apply)
+           cluster_secondary_range_name  = "gke-management-cluster-pod-subnet-1"
+           services_ipv4_cidr_block      = (known after apply)
+           services_secondary_range_name = "gke-management-cluster-service-subnet-1"
+           stack_type                    = "IPV4"

+           pod_cidr_overprovision_config (known after apply)
        }

+       logging_config (known after apply)

+       maintenance_policy {
+           daily_maintenance_window {
+               duration   = (known after apply)
+               start_time = "05:00"
            }
        }

+       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
+           cluster_ca_certificate = (known after apply)

+           client_certificate_config {
+               issue_client_certificate = false
            }
        }

+       master_authorized_networks_config {
+           gcp_public_cidrs_access_enabled      = (known after apply)
+           private_endpoint_enforcement_enabled = (known after apply)

+           cidr_blocks {
+               cidr_block   = "10.80.0.0/16"
+               display_name = "jrc-online_network"
            }
+           cidr_blocks {
+               cidr_block   = "10.80.21.240/28"
+               display_name = "twingate_network"
            }
+           cidr_blocks {
+               cidr_block   = "10.81.0.0/16"
+               display_name = "argocd"
            }
        }

+       mesh_certificates {
+           enable_certificates = false
        }

+       monitoring_config (known after apply)

+       network_policy {
+           enabled  = true
+           provider = "CALICO"
        }

+       node_config (known after apply)

+       node_pool {
+           initial_node_count          = 0
+           instance_group_urls         = (known after apply)
+           managed_instance_group_urls = (known after apply)
+           max_pods_per_node           = (known after apply)
+           name                        = "default-pool"
+           name_prefix                 = (known after apply)
+           node_count                  = (known after apply)
+           node_locations              = (known after apply)
+           version                     = (known after apply)

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           network_config (known after apply)

+           node_config {
+               disk_size_gb                = (known after apply)
+               disk_type                   = (known after apply)
+               effective_taints            = (known after apply)
+               enable_confidential_storage = false
+               image_type                  = "UBUNTU_CONTAINERD"
+               labels                      = (known after apply)
+               local_ssd_count             = (known after apply)
+               logging_variant             = "DEFAULT"
+               machine_type                = "e2-standard-2"
+               metadata                    = (known after apply)
+               min_cpu_platform            = (known after apply)
+               oauth_scopes                = (known after apply)
+               preemptible                 = false
+               service_account             = (known after apply)
+               spot                        = false
+               tags                        = [
+                   "gke-jrc-online-management-gke-cluster",
+                   "gke-jrc-online-management-gke-cluster-default-pool",
                ]

+               confidential_nodes (known after apply)

+               gcfs_config {
+                   enabled = false
                }

+               guest_accelerator (known after apply)

+               kubelet_config (known after apply)

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings (known after apply)
        }

+       node_pool_auto_config (known after apply)

+       node_pool_defaults {
+           node_config_defaults {
+               insecure_kubelet_readonly_port_enabled = (known after apply)
+               logging_variant                        = (known after apply)

+               gcfs_config {
+                   enabled = false
                }
            }
        }

+       notification_config {
+           pubsub {
+               enabled = false
#                (1 unchanged attribute hidden)
            }
        }

+       private_cluster_config {
+           enable_private_endpoint     = true
+           enable_private_nodes        = true
+           master_ipv4_cidr_block      = (known after apply)
+           peering_name                = (known after apply)
+           private_endpoint            = (known after apply)
+           private_endpoint_subnetwork = "gke-management-private-endpoint-subnet-1"
+           public_endpoint             = (known after apply)

+           master_global_access_config {
+               enabled = true
            }
        }

+       protect_config {
+           workload_vulnerability_mode = (known after apply)

+           workload_config {
+               audit_mode = "DISABLED"
            }
        }

+       release_channel {
+           channel = "REGULAR"
        }

+       security_posture_config {
+           mode               = "DISABLED"
+           vulnerability_mode = "VULNERABILITY_DISABLED"
        }

+       service_external_ips_config (known after apply)

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       tpu_config (known after apply)

+       vertical_pod_autoscaling {
+           enabled = true
        }

+       workload_alts_config (known after apply)

+       workload_identity_config {
+           workload_pool = "concise-mesh-453415-t8.svc.id.goog"
        }
    }

  # module.gke_dev.module.gke.google_container_node_pool.pools["management-node-pool"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "jrc-online-management-gke-cluster"
+       id                          = (known after apply)
+       initial_node_count          = 1
+       instance_group_urls         = (known after apply)
+       location                    = "europe-west1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "management-node-pool"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = (known after apply)
+       operation                   = (known after apply)
+       project                     = "concise-mesh-453415-t8"
+       version                     = (known after apply)

+       autoscaling {
+           location_policy = (known after apply)
+           max_node_count  = 100
+           min_node_count  = 1
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       network_config (known after apply)

+       node_config {
+           disk_size_gb                = 100
+           disk_type                   = "pd-standard"
+           effective_taints            = (known after apply)
+           enable_confidential_storage = false
+           image_type                  = "UBUNTU_CONTAINERD"
+           labels                      = {
+               "cluster_name" = "jrc-online-management-gke-cluster"
+               "node_pool"    = "management-node-pool"
            }
+           local_ssd_count             = 0
+           logging_variant             = "DEFAULT"
+           machine_type                = "e2-standard-2"
+           metadata                    = {
+               "cluster_name"             = "jrc-online-management-gke-cluster"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "management-node-pool"
            }
+           min_cpu_platform            = (known after apply)
+           oauth_scopes                = [
+               "https://www.googleapis.com/auth/cloud-platform",
            ]
+           preemptible                 = false
+           service_account             = (known after apply)
+           spot                        = true
+           tags                        = [
+               "gke-jrc-online-management-gke-cluster",
+               "gke-jrc-online-management-gke-cluster-management-node-pool",
            ]
#            (1 unchanged attribute hidden)

+           confidential_nodes (known after apply)

+           gcfs_config {
+               enabled = false
            }

+           guest_accelerator (known after apply)

+           kubelet_config (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
+           strategy        = "SURGE"

+           blue_green_settings (known after apply)
        }
    }

  # module.gke_dev.module.gke.google_project_iam_member.cluster_service_account_artifact_registry["concise-mesh-453415-t8"] will be created
+   resource "google_project_iam_member" "cluster_service_account_artifact_registry" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "concise-mesh-453415-t8"
+       role    = "roles/artifactregistry.reader"
    }

  # module.gke_dev.module.gke.google_project_iam_member.cluster_service_account_gcr["concise-mesh-453415-t8"] will be created
+   resource "google_project_iam_member" "cluster_service_account_gcr" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "concise-mesh-453415-t8"
+       role    = "roles/storage.objectViewer"
    }

  # module.gke_dev.module.gke.google_project_iam_member.cluster_service_account_metric_writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account_metric_writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "concise-mesh-453415-t8"
+       role    = "roles/monitoring.metricWriter"
    }

  # module.gke_dev.module.gke.google_project_iam_member.cluster_service_account_node_service_account[0] will be created
+   resource "google_project_iam_member" "cluster_service_account_node_service_account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "concise-mesh-453415-t8"
+       role    = "roles/container.defaultNodeServiceAccount"
    }

  # module.gke_dev.module.gke.google_project_iam_member.cluster_service_account_resource_metadata_writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account_resource_metadata_writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "concise-mesh-453415-t8"
+       role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke_dev.module.gke.google_service_account.cluster_service_account[0] will be created
+   resource "google_service_account" "cluster_service_account" {
+       account_id   = "*************************"
+       disabled     = false
+       display_name = "Terraform-managed service account for cluster jrc-online-management-gke-cluster"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "concise-mesh-453415-t8"
+       unique_id    = (known after apply)
    }

  # module.gke_dev.module.gke.random_shuffle.available_zones[0] will be created
+   resource "random_shuffle" "available_zones" {
+       id           = (known after apply)
+       input        = (known after apply)
+       result       = (known after apply)
+       result_count = 3
    }

  # module.gke_dev.module.projects_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/iam.workloadIdentityUser--serviceAccount:concise-mesh-453415-t8.svc.id.goog[argocd/argocd-application-controller]"] will be created
+   resource "google_project_iam_member" "project_iam_additive" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:concise-mesh-453415-t8.svc.id.goog[argocd/argocd-application-controller]"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.workloadIdentityUser"
    }

  # module.gke_dev.module.projects_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/iam.workloadIdentityUser--serviceAccount:concise-mesh-453415-t8.svc.id.goog[argocd/argocd-server]"] will be created
+   resource "google_project_iam_member" "project_iam_additive" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:concise-mesh-453415-t8.svc.id.goog[argocd/argocd-server]"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.workloadIdentityUser"
    }

  # module.gke_dev.module.projects_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/iam.workloadIdentityUser--serviceAccount:concise-mesh-453415-t8.svc.id.goog[cert-manager/cert-manager]"] will be created
+   resource "google_project_iam_member" "project_iam_additive" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:concise-mesh-453415-t8.svc.id.goog[cert-manager/cert-manager]"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.workloadIdentityUser"
    }

  # module.gke_dev.module.projects_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/iam.workloadIdentityUser--serviceAccount:concise-mesh-453415-t8.svc.id.goog[external-dns-private/external-dns-private]"] will be created
+   resource "google_project_iam_member" "project_iam_additive" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:concise-mesh-453415-t8.svc.id.goog[external-dns-private/external-dns-private]"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.workloadIdentityUser"
    }

  # module.gke_dev.module.projects_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/iam.workloadIdentityUser--serviceAccount:concise-mesh-453415-t8.svc.id.goog[external-dns-public/external-dns-public]"] will be created
+   resource "google_project_iam_member" "project_iam_additive" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:concise-mesh-453415-t8.svc.id.goog[external-dns-public/external-dns-public]"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.workloadIdentityUser"
    }

  # module.gke_dev.module.projects_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/iam.workloadIdentityUser--serviceAccount:concise-mesh-453415-t8.svc.id.goog[external-secrets/external-secrets]"] will be created
+   resource "google_project_iam_member" "project_iam_additive" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:concise-mesh-453415-t8.svc.id.goog[external-secrets/external-secrets]"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.workloadIdentityUser"
    }

  # module.gke_dev.module.projects_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/iam.workloadIdentityUser--serviceAccount:concise-mesh-453415-t8.svc.id.goog[velero-system/velero-server]"] will be created
+   resource "google_project_iam_member" "project_iam_additive" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:concise-mesh-453415-t8.svc.id.goog[velero-system/velero-server]"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.workloadIdentityUser"
    }

  # module.twingate.module.container[0].data.google_compute_image.coreos will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_image" "coreos" {
+       archive_size_bytes                = (known after apply)
+       creation_timestamp                = (known after apply)
+       description                       = (known after apply)
+       disk_size_gb                      = (known after apply)
+       family                            = "cos-stable"
+       id                                = (known after apply)
+       image_encryption_key_sha256       = (known after apply)
+       image_id                          = (known after apply)
+       label_fingerprint                 = (known after apply)
+       labels                            = (known after apply)
+       licenses                          = (known after apply)
+       name                              = (known after apply)
+       project                           = "cos-cloud"
+       self_link                         = (known after apply)
+       source_disk                       = (known after apply)
+       source_disk_encryption_key_sha256 = (known after apply)
+       source_disk_id                    = (known after apply)
+       source_image_id                   = (known after apply)
+       status                            = (known after apply)
    }

  # module.twingate.module.container[1].data.google_compute_image.coreos will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_image" "coreos" {
+       archive_size_bytes                = (known after apply)
+       creation_timestamp                = (known after apply)
+       description                       = (known after apply)
+       disk_size_gb                      = (known after apply)
+       family                            = "cos-stable"
+       id                                = (known after apply)
+       image_encryption_key_sha256       = (known after apply)
+       image_id                          = (known after apply)
+       label_fingerprint                 = (known after apply)
+       labels                            = (known after apply)
+       licenses                          = (known after apply)
+       name                              = (known after apply)
+       project                           = "cos-cloud"
+       self_link                         = (known after apply)
+       source_disk                       = (known after apply)
+       source_disk_encryption_key_sha256 = (known after apply)
+       source_disk_id                    = (known after apply)
+       source_image_id                   = (known after apply)
+       status                            = (known after apply)
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   cluster_endpoint      = (known after apply)
```
</details>

:memo: Plan generated in [PR-PLAN #14](https://github.com/Workquark/Terraform/actions/runs/14129804367)